In [3]:
import numpy as np
import pandas as pd

In [4]:
lis=[1,2,3,4,5]
ser=pd.Series(lis,index=["a","b","c","d","e"])
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
ser.ndim

1

In [11]:
ser3=pd.Series([1,2,3,4,5])
ser4=pd.Series([6,7,8,9,0])
dataFrame=pd.DataFrame(data=[ser3,ser4],index=["a","b"])
dataFrame

   0  1  2  3  4
a  1  2  3  4  5
b  6  7  8  9  0

In [13]:
dic2={"name":["a","b","c","d"],"age":[23,34,56,23],"class":["A","B","C","D"]}
dataFrame3=pd.DataFrame(dic2)
dataFrame3

  name  age class
0    a   23     A
1    b   34     B
2    c   56     C
3    d   23     D

In [15]:
# to read a file
#.to_csv("filename")

In [17]:
df=pd.read_csv("player.csv")
df.head()

   rank          name  matches  innings  runs  highest  100s  50s
0     1       V Kohli      207      199  6283      113     5   42
1     2      S Dhawan      194      191  5784      106     2   44
2     3  Rohit Sharma      213      208  5611      109     1   40
3     4  Suresh Raina      205      200  5528      100     1   39
4     5  David Warner      150      150  5449      126     4   50

In [19]:
df.info

<bound method DataFrame.info of    rank             name  matches  innings  runs  highest  100s  50s
0     1          V Kohli      207      199  6283      113     5   42
1     2         S Dhawan      194      191  5784      106     2   44
2     3     Rohit Sharma      213      208  5611      109     1   40
3     4     Suresh Raina      205      200  5528      100     1   39
4     5     David Warner      150      150  5449      126     4   50
5     6  A B de Villiers      184      170  5162      133     3   40
6     7      Chris Gayle      142      141  4965      175     6   31
7     8        M S Dhoni      220      193  4746       84     0   23
8     9    Robin Uthappa      193      186  4722       87     0   25
9    10    Gutam Gambhir      154      152  4217       93     0   36>

In [21]:
df.describe()

,rank,matches,innings,runs,highest,100s,50s
count,10.00000,10.000000,10.000000,10.000000,10.000000,10.00000,10.000000
mean,5.50000,186.200000,179.000000,5246.700000,112.600000,2.20000,37.000000
std,3.02765,28.007142,23.958297,604.446496,27.002881,2.20101,8.445906
min,1.00000,142.000000,141.000000,4217.000000,84.000000,0.00000,23.000000
25%,3.25000,161.500000,156.500000,4800.750000,94.750000,0.25000,32.250000
50%,5.50000,193.500000,188.500000,5305.500000,107.500000,1.50000,39.500000
75%,7.75000,206.500000,197.500000,5590.250000,122.750000,3.75000,41.500000
max,10.00000,220.000000,208.000000,6283.000000,175.000000,6.00000,50.000000

In [23]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [103]:
df["More_100s"]=(df["100s"]>=4).astype("int")

In [107]:
df["More_50s"]=(df["50s"]>=40).astype("int")

In [109]:
df["Best_player"]=((df["100s"]>=3) & (df["50s"]>=40)).astype("int")

In [111]:
df["top_players"]=np.where((df["100s"]>=3) & (df["50s"]>=40),1,0)

In [115]:
df.head()

,rank,name,matches,innings,runs,highest,100s,50s,More_100s,More_50s,Best_player,top_players
0,1,V Kohli,207,199,6283,113,5,42,1,1,1,1
1,2,S Dhawan,194,191,5784,106,2,44,0,1,0,0
2,3,Rohit Sharma,213,208,5611,109,1,40,0,1,0,0
3,4,Suresh Raina,205,200,5528,100,1,39,0,0,0,0
4,5,David Warner,150,150,5449,126,4,50,1,1,1,1

In [29]:
titanic=pd.read_csv("titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
#fillna()#mean,mode
#ffill()
#bfill()

In [33]:
titanic["Age"].mean()

29.69911764705882

In [37]:
#titanic["Age"].fillna(titanic["Age"].mean(),inplace=True)

In [39]:
titanic["Cabin"].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [41]:
#titanic["Cabin"].fillna(titanic["Cabin"].mode()[0],inplace=True)

In [43]:
titanic["Cabin"].isnull().sum()

687

In [45]:
titanic["Cabin"]=titanic["Cabin"].ffill().inplace=True

In [47]:
titanic["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [49]:
titanic.iloc[10:17,0:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0
16,17,0,3,"Rice, Master. Eugene",male,2.0,4

In [57]:
titanic.loc[8:10]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,True,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,True,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,True,S

In [65]:
dff2=titanic.groupby(["Pclass","Name"]).value_counts()
dff2

Pclass  Name                                             PassengerId  Survived  Sex     Age        SibSp  Parch  Ticket    Fare      Cabin  Embarked
1       Allen, Miss. Elisabeth Walton                    731          1         female  29.000000  0      0      24160     211.3375  True   S           1
        Allison, Master. Hudson Trevor                   306          1         male    0.920000   1      2      113781    151.5500  True   S           1
        Allison, Miss. Helen Loraine                     298          0         female  2.000000   1      2      113781    151.5500  True   S           1
        Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  499          0         female  25.000000  1      2      113781    151.5500  True   S           1
        Anderson, Mr. Harry                              461          1         male    48.000000  0      0      19952     26.5500   True   S           1
                                                                                                                                                       ..
3       de Messemaeker, Mrs. Guillaume Joseph (Emma)     560          1         female  36.000000  1      0      345572    17.4000   True   S           1
        de Mulder, Mr. Theodore                          287          1         male    30.000000  0      0      345774    9.5000    True   S           1
        de Pelsmaeker, Mr. Alfons                        283          0         male    16.000000  0      0      345778    9.5000    True   S           1
        van Billiard, Mr. Austin Blyler                  154          0         male    40.500000  0      2      A/5. 851  14.5000   True   S           1
        van Melkebeke, Mr. Philemon                      869          0         male    29.699118  0      0      345777    9.5000    True   S           1
Name: count, Length: 889, dtype: int64

In [71]:
dff3=titanic.groupby(["Parch"]).groups
dff3

{0: [0, 1, 2, 3, 4, 5, 6, 9, 11, 12, 14, 15, 17, 18, 19, 20, 21, 22, 23, 26, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 44, 45, 46, 47, 48, 49, 51, 52, 53, 55, 56, 57, 60, 61, 62, 64, 66, 67, 69, 70, 72, 73, 74, 75, 76, 77, 79, 80, 81, 82, 83, 84, 85, 87, 89, 90, 91, 92, 94, 95, 96, 99, 100, 101, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 120, 121, 122, 123, 125, 126, ...], 1: [7, 10, 16, 24, 50, 54, 65, 97, 98, 102, 118, 124, 128, 145, 155, 160, 164, 166, 171, 172, 175, 176, 183, 188, 193, 197, 205, 229, 248, 251, 259, 262, 266, 268, 272, 273, 278, 279, 299, 312, 314, 319, 323, 328, 329, 332, 340, 348, 352, 356, 362, 374, 407, 409, 416, 423, 424, 440, 446, 448, 469, 479, 485, 489, 523, 529, 530, 532, 548, 549, 558, 580, 581, 587, 595, 600, 616, 618, 622, 637, 644, 651, 657, 670, 679, 684, 686, 689, 691, 698, 702, 709, 720, 745, 746, 750, 751, 755, 779, 787, ...], 2: [8, 27, 43, 58, 59, 63, 68, 71, 78, 88, 93, 119, 136, 140, 147, 148, 153, 159, 165, 180, 182, 184, 201, 233, 237, 247, 254, 255, 261, 297, 305, 311, 318, 324, 341, 377, 381, 386, 390, 394, 417, 419, 435, 436, 445, 450, 472, 480, 498, 506, 533, 535, 539, 540, 541, 542, 550, 585, 593, 608, 615, 634, 642, 659, 683, 685, 742, 754, 763, 783, 788, 792, 802, 813, 819, 827, 846, 850, 863, 888], 3: [86, 437, 736, 774, 858], 4: [167, 360, 438, 567], 5: [13, 25, 610, 638, 885], 6: [678]}

In [73]:
dff4=titanic.groupby(["Parch"])
dff4

In [77]:
dff4.get_group(" Allison, Miss. Helen Loraine")

C:\Users\DELL\AppData\Local\Temp\ipykernel_17344\2791179247.py:1: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  dff4.get_group(" Allison, Miss. Helen Loraine")

KeyError: ' Allison, Miss. Helen Loraine'

In [79]:
dff4.last()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
Parch,,,,,,,,,,,
0,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,370376,7.7500,True,Q
1,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.000000,0,230433,26.0000,True,S
2,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,W./C. 6607,23.4500,True,S
3,859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.000000,0,2666,19.2583,True,C
4,568,0,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.000000,0,349909,21.0750,True,S
5,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,382652,29.1250,True,Q
6,679,0,3,"Goodwin, Mrs. Frederick (Augusta Tyler)",female,43.000000,1,CA 2144,46.9000,True,S

In [85]:
dff5=titanic.groupby(["Sex","Cabin","Embarked"])["PassengerId"].mean()
dff5

Sex     Cabin  Embarked
female  True   C           437.315068
               Q           374.138889
               S           438.709360
male    True   C           451.536842
               Q           456.317073
               S           454.507937
Name: PassengerId, dtype: float64

In [91]:
dff5=titanic.groupby(["Sex","Cabin","Embarked"])["PassengerId"].median()
dff

NameError: name 'dff' is not defined

In [97]:

titanic["PassengerId"]=titanic["PassengerId"].apply(lambda x:1 if x=="889" else 0)